Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: With this function you can indicate to the garbage collector that it shoulde aim to spend no more than the time specified running each frame.
zh_cn: 通过此函数，您可以向垃圾收集器指示，它的目标是不超过运行每帧所指定的时间。

source: With this function you can insert a new point into a path (the path can have been created in the path editor or through code using path_add()).
zh_cn: 通过此函数，您可以在路径中插入一个新点(路径可以在路径编辑器中创建，也可以通过使用path_add()的代码创建)。

source: With this function you can insert a value (or values) into an array at any given position.
zh_cn: 使用此函数，您可以在数组的任何给定位置插入一个(或多个)值。

source: With this function you can join two or more arrays into a single one, removing the duplicates
zh_cn: 通过此函数，您可以将两个或多个数组合并为一个，删除重复项

source: With this function you can join two particle groups together, and the joined groups will then behave as if they were both part of a single entity.
zh_cn: 通过此函数，您可以将两个粒子组连接在一起，然后连接的粒子组将表现得好像它们都是单个实体的一部分。

source: With this function you can load a file that you have created previously using the buffer_save() function (or any of the other functions for saving buffers) into a buffer.
zh_cn: 使用此函数，您可以将之前使用buffer_save()函数(或任何其他用于保存缓冲区的函数)创建的文件加载到缓冲区中。

source: With this function you can load a game state that has been saved previously.
zh_cn: 通过此函数，您可以加载之前保存的游戏状态。

source: With this function you can load a game that has been previously saved using game_save().
zh_cn: 通过此函数，你可以加载之前使用game_save()保存的游戏。

source: With this function you can load all the pages for the specified texture group.
zh_cn: 通过此函数，你可以加载指定纹理组的所有页面。

source: With this function you can maintain an input value between a specified range.
zh_cn: 通过此函数，您可以将输入值保持在指定的范围内。

source: With this function you can make your game go to the next one as listed in the Room Manager at the time the game was compiled.
zh_cn: 通过此函数，你可以让你的游戏进入游戏编译时房间管理器中列出的下一个。

source: With this function you can make your game go to the previous one as listed in the Room Manager at the time the game was compiled.
zh_cn: 通过此函数，你可以让你的游戏回到之前的房间管理器中列出的游戏编译时间。

source: With this function you can make your particles be drawn with an additive blend mode (true) or not (false).
zh_cn: 通过此函数，你可以用添加混合模式(true)或不(false)绘制粒子。

source: With this function you can multiply two matrix arrays together to create a new transform matrix.
zh_cn: 使用此函数，您可以将两个矩阵数组相乘以创建一个新的变换矩阵。

source: With this function you can mutate an existing array by mapping the element values using the given predicate.
zh_cn: 使用此函数，您可以通过使用给定的条件映射元素值来改变现有的数组。

source: With this function you can mutate an existing array reversing the elements order.
zh_cn: 使用此函数，您可以改变现有数组的元素顺序。

source: With this function you can mutate an existing array to filter the elements that return true to the given predicate.
zh_cn: 使用此函数，您可以更改现有数组，以筛选返回给定条件下为true的元素。

source: With this function you can mutate an existing array with only unique value.
zh_cn: 使用此函数，您可以更改仅具有唯一值的现有数组。

source: With this function you can open a video from the specified path or url
zh_cn: 通过此函数，您可以从指定的路径或url打开视频

source: With this function you can override (replace) all instances of an object used in a sequence with another one.
zh_cn: 使用此函数，您可以用另一个对象覆盖(替换)序列中使用的对象的所有实例。

source: With this function you can pause all sounds that are currently playing.
zh_cn: 通过此函数，你可以暂停所有正在播放的声音。

source: With this function you can pause any sound that is currently playing.
zh_cn: 通过此函数，你可以暂停任何正在播放的声音。

source: With this function you can pause the playback of the given sequence.
zh_cn: 使用此函数，您可以暂停给定序列的回放。

source: With this function you can play any sound resource at a given position within the audio space.
zh_cn: 通过此函数，你可以在音频空间的给定位置播放任何声音资源。

source: With this function you can play any sound resource in your game.
zh_cn: 通过此函数，你可以在游戏中播放任何声音资源。

source: With this function you can play any sound resource through an emitter, with any changes to the emitter gain, position, pitch or velocity affecting how the user hears the final sound being played.
zh_cn: 通过此函数，您可以通过发射器播放任何声音资源，对发射器增益、位置、音高或速度的任何更改都会影响用户听到播放的最终声音。

source: With this function you can poll the window (or tab) state and if it loses focus the function will return false otherwise it will return true.
zh_cn: 使用此函数，您可以轮询窗口(或选项卡)状态，如果失去焦点，函数将返回false，否则将返回true。

source: With this function you can populate a (pre-created) DS list with all the names of the animations included as part of the skeletal animation sprite.
zh_cn: 通过此函数，你可以填充一个(预先创建的)DS列表，其中包含作为骨骼动画精灵一部分的所有动画名称。

source: With this function you can populate a (pre-created) DS list with all the names of the bones used as part of the skeletal animation sprite.
zh_cn: 通过此函数，您可以使用作为骨骼动画精灵一部分的所有骨骼名称填充(预先创建的)DS列表。

source: With this function you can populate a (pre-created) DS list with all the names of the slots created as part of the skeletal animation sprite.
zh_cn: 使用此函数，您可以使用作为骨骼动画精灵的一部分创建的所有插槽的名称填充(预先创建的)DS列表。

source: With this function you can populate a (pre-created) DS list with data for each of the available attachment slots for the Spine sprite associated with the current instance (including any attachment modifications).
zh_cn: 使用此函数，您可以使用与当前实例相关联的Spine sprite的每个可用附件插槽的数据填充(预先创建的)DS列表(包括任何附件修改)。

source: With this function you can populate a (pre-created) DS list with data for each of the available attachment slots that an animation contains.
zh_cn: 通过此函数，您可以为动画包含的每个可用附件插槽填充一个(预先创建的)DS列表。

source: With this function you can populate a (pre-created) DS list with all the names of the skins included as part of the skeletal animation sprite.
zh_cn: 使用此函数，您可以使用骨骼动画精灵中包含的所有皮肤名称来填充(预先创建的)DS列表。

source: With this function you can push a value (or values) onto the end of an array without having to know the length of the array.
zh_cn: 使用此函数，您可以将一个(或多个)值压入数组的末尾，而不必知道数组的长度。

source: With this function you can push the current GPU state onto a stack to be used later.
zh_cn: 通过此函数，你可以把当前的GPU状态推到堆栈上，以便以后使用。

source: With this function you can read a real number value from a text file and the function returns that value to be used or stored in a variable.
zh_cn: 使用此函数，您可以从文本文件读取实数值，然后函数返回该值以使用或存储在变量中。

source: With this function you can read a string from a text file and the function returns that value to be used or stored in a variable.
zh_cn: 使用此函数，您可以从文本文件中读取字符串，然后函数返回该值以使用或存储在变量中。

source: With this function you can recreate a saved DS list (one that has previously been written as a string using ds_list_write()).
zh_cn: 使用此函数，您可以重新创建一个保存的DS列表(之前已经使用ds_list_write()作为字符串写入的列表)。

source: With this function you can recreate a saved DS priority (one that has previously been written as a string using ds_priority_write()).
zh_cn: 通过此函数，你可以重新创建一个保存的DS优先级(这个优先级以前已经使用ds_priority_write()作为字符串写入)。

source: With this function you can recreate a saved DS queue (one that has previously been written as a string using ds_queue_write()).
zh_cn: 使用此函数，您可以重新创建一个已保存的DS队列(之前已经使用ds_queue_write()作为字符串写入的队列)。

source: With this function you can recreate a saved DS stack (one that has previously been written as a string using ds_stack_write()).
zh_cn: 使用此函数，您可以重新创建一个已保存的DS堆栈(之前已经使用ds_stack_write()作为字符串写入的堆栈)。

source: With this function you can remove a network socket connection from your game.
zh_cn: 通过此函数，你可以从游戏中删除网络套接字连接。

source: With this function you can remove a point from the specified path.
zh_cn: 通过此函数，您可以从指定路径中删除一个点。

source: With this function you can remove a variable from a struct.
zh_cn: 使用此函数，您可以从结构中删除变量。

source: With this function you can remove all characters that are not classed as letters.
zh_cn: 通过此函数，您可以删除所有不属于字母的字符。

source: With this function you can remove all point definitions from a path, effectively making an "empty" path.
zh_cn: 通过此函数，您可以从路径中删除所有点定义，有效地创建一个"空"路径。

source: With this function you can remove all textures from video memory, and they will then be reloaded on first use.
zh_cn: 通过此函数，你可以从视频内存中删除所有的纹理，然后他们将在第一次使用时重新加载。

source: With this function you can remove any given key (and its corresponding value) from the given, previously created, DS map .
zh_cn: 使用此函数，您可以从先前创建的DS map中删除任何给定的键(及其对应的值)。

source: With this function you can remove one or more tag strings to any asset from the asset browser.
zh_cn: 使用此函数，您可以从资源浏览器中删除任何资源的一个或多个标记字符串。

source: With this function you can remove the any number of texture pages for the given sprites from texture memory.
zh_cn: 使用此函数，你可以从纹理内存中删除给定精灵的任意数量的纹理页面。

source: With this function you can remove the given emitter from memory.
zh_cn: 使用此函数，您可以从内存中删除给定的发射器。

source: With this function you can remove the given texture page for the given sprite from texture memory.
zh_cn: 使用此函数，你可以从纹理存储器中删除给定精灵的纹理页面。

source: With this function you can remove the selected key (and its corresponding value) from an ini file.
zh_cn: 通过此函数，您可以从ini文件中删除选定的键(及其相应的值)。

source: With this function you can remove the specified particle type from the game.
zh_cn: 通过此函数，您可以从游戏中移除指定的粒子类型。

source: With this function you can remove the value stored at a specific position within the list.
zh_cn: 通过此函数，您可以删除存储在列表中特定位置的值。

source: With this function you can replace a DS Map that has been stored in the given "key" with another map that has been created previously.
zh_cn: 通过此函数，你可以用之前创建的另一个映射替换存储在给定"键"中的DS Map。

source: With this function you can replace a DS list that has been stored in the given "key" with another list that has been created previously.
zh_cn: 使用此函数，您可以用之前创建的另一个列表替换存储在给定"键"中的DS列表。

source: With this function you can resize a given buffer to be the size (in bytes) that you specify.
zh_cn: 使用此函数，你可以把一个给定的缓冲区调整到你指定的大小(以字节为单位)。

source: With this function you can resize an existing array dimension to a new size.
zh_cn: 通过此函数，您可以将现有的数组维度调整为新的大小。

source: With this function you can resize the given DS grid to have a different width and/or height.
zh_cn: 通过此函数，您可以调整给定DS网格的大小，使其具有不同的宽度和/或高度。

source: With this function you can restart the game.
zh_cn: 用此函数你可以重启游戏。

source: With this function you can resume all sounds that have been paused previously.
zh_cn: 通过此函数，您可以恢复之前暂停的所有声音。

source: With this function you can resume any sound that is currently paused (after using the function audio_pause_sound()).
zh_cn: 通过此函数，您可以恢复当前暂停的任何声音(使用audio_pause_sound()函数后)。

source: With this function you can retrieve a value from the end of an array without having to know the length of the array.
zh_cn: 使用此函数，您可以从数组的末尾检索值，而不需要知道数组的长度。

source: With this function you can retrieve all of the keys that a DS map contains.
zh_cn: 使用此函数，您可以检索DS map包含的所有键。

source: With this function you can retrieve all of the values that a DS map contains for each key in the map.
zh_cn: 通过此函数，您可以检索DS map为映射中的每个键所包含的所有值。

source: With this function you can retrieve all the tags assigned to an asset from the Asset Browser.
zh_cn: 通过此函数，您可以从资源浏览器中检索分配给资源的所有标记。

source: With this function you can retrieve an array of all the object indices that have instances being created within the given sequence.
zh_cn: 使用此函数，您可以检索所有对象索引的数组，这些对象索引在给定序列中创建了实例。

source: With this function you can retrieve an array populated with the instance variable names for an instance, or the global variables for a game.
zh_cn: 通过此函数，你可以检索一个由实例变量名填充的数组，或者一个游戏的全局变量。

source: With this function you can retrieve an array populated with the variable names from a struct.
zh_cn: 使用此函数，您可以从结构中检索用变量名填充的数组。

source: With this function you can retrieve information about the current state of the garbage collector.
zh_cn: 通过此函数，您可以检索关于垃圾收集器当前状态的信息。

source: With this function you can retrieve that seed, which can then be stored to reproduce a specific series of random events.
zh_cn: 通过此函数，您可以检索该种子，然后将其存储起来以再现特定的随机事件系列。

source: With this function you can retrieve the GUID for the gamepad connected to the given slot index.
zh_cn: 通过此函数，您可以检索连接到给定插槽索引的手柄的GUID。

source: With this function you can retrieve the Script index for the script where the method was defined.
zh_cn: 通过此函数，您可以检索定义方法的脚本的Script索引。

source: With this function you can retrieve the angular velocity of a group of particles.
zh_cn: 用此函数你可以得到一组粒子的角速度。

source: With this function you can retrieve the current target frame value for the garbage collector.
zh_cn: 通过此函数，您可以为垃圾收集器检索当前目标帧值。

source: With this function you can retrieve the details of a view port in a room other than the current one.
zh_cn: 通过此函数，您可以检索当前房间以外的其他房间中的视图端口的详细信息。

source: With this function you can retrieve the font index of each of the fonts assigned to texture pages within the given texture group.
zh_cn: 通过此函数，你可以在给定的纹理组中检索分配给纹理页面的每个字体的字体索引。

source: With this function you can retrieve the group flags for a group of particles.
zh_cn: 使用此函数，您可以检索一组粒子的组标志。

source: With this function you can retrieve the horizontal velocity of a group of particles.
zh_cn: 用此函数你可以得到一组粒子的水平速度。

source: With this function you can retrieve the index of the room after the room input into the function.
zh_cn: 通过此函数，您可以在将房间输入到此函数后检索房间的索引。

source: With this function you can retrieve the index of the room before the room input into the function.
zh_cn: 通过此函数，您可以在将房间输入到此函数之前检索房间的索引。

source: With this function you can retrieve the inertia of an entire group of particles.
zh_cn: 通过此函数，您可以检索整个粒子组的惯性。

source: With this function you can retrieve the instance ID or struct reference which is the self context used when the method is called.
zh_cn: 使用此函数，您可以检索实例ID或结构引用，这是调用方法时使用的self上下文。

source: With this function you can retrieve the load status of the specified texture group.
zh_cn: 通过此函数，你可以检索指定纹理组的加载状态。

source: With this function you can retrieve the mipmap bias value for a given shader sampler.
zh_cn: 使用此函数，您可以检索给定着色器采样器的mipmap偏移值。

source: With this function you can retrieve the mipmap bias value, where a value of 0 equals no bias, 1 equals the first mipmap, 2 equals the second mipmap etc...
zh_cn: 通过此函数，您可以检索多纹理贴图偏移值，其中值0等于无偏移，1等于第一个多纹理贴图，2等于第二个多纹理贴图，依此类推...

source: With this function you can retrieve the name of a shader resource.
zh_cn: 使用此函数，你可以检索着色器资源的名称。

source: With this function you can retrieve the name string that has been stored in the high score list at the given position.
zh_cn: 通过此函数，您可以检索存储在高分列表中给定位置的名称字符串。

source: With this function you can retrieve the names of all assets that have been assigned the given tag or tags.
zh_cn: 通过此函数，您可以检索已分配给给定标签的所有资源的名称。

source: With this function you can retrieve the priority of any given value.
zh_cn: 使用此函数，您可以检索任何给定值的优先级。

source: With this function you can retrieve the rotation (angle) in the room of a group of particles.
zh_cn: 通过此函数，您可以检索一组粒子在房间中的旋转(角度)。

source: With this function you can retrieve the sequence object struct from a sequence asset index.
zh_cn: 使用此函数，您可以从序列资源索引中检索序列对象结构。

source: With this function you can retrieve the sprite index of each of the sprites assigned to texture pages within the given texture group.
zh_cn: 通过此函数，你可以在给定的纹理组中检索分配给纹理页面的每个精灵的精灵索引。

source: With this function you can retrieve the tileset index of each of the tilesets assigned to texture pages within the given texture group.
zh_cn: 通过此函数，你可以在给定的纹理组中检索分配给纹理页面的每个tileset的索引。

source: With this function you can retrieve the value from an index in an array.
zh_cn: 使用此函数，您可以从数组的索引中检索值。

source: With this function you can retrieve the vertical velocity of a group of particles.
zh_cn: 用此函数你可以得到一组粒子的垂直速度。

source: With this function you can retrieve the x component of the center of mass of an entire group of particles.
zh_cn: 通过此函数，您可以检索一整组粒子的质心的x分量。

source: With this function you can retrieve the x position in the room of a group of particles.
zh_cn: 用此函数你可以检索一组粒子在房间里的x位置。

source: With this function you can retrieve the y component of the center of mass of an entire group of particles.
zh_cn: 使用此函数，您可以检索一整组粒子的质心的y分量。

source: With this function you can retrieve the y position in the room of a group of particles.
zh_cn: 用此函数你可以检索一组粒子在房间里的y位置。

source: With this function you can return the first element of the array or undefined if the array is empty.
zh_cn: 使用此函数，您可以返回数组的第一个元素，如果数组为空，则返回undefined。

source: With this function you can return the last element of the array or undefined if the array is empty.
zh_cn: 使用此函数，您可以返回数组的最后一个元素，如果数组为空，则返回undefined。

source: With this function you can reverse the order in which the individual path points are numbered, so, for example, if the path has 5 points, point 0 would become point 4, point 1 would be point 3 and point 2 would not be changed.
zh_cn: 通过此函数，您可以反转各个路径点的编号顺序，例如，如果路径有5个点，则点0将成为点4，点1将成为点3，而点2将保持不变。

source: With this function you can save a frame to a GIF file from a surface.
zh_cn: 通过此函数，您可以从表面上将帧保存为GIF文件。

source: With this function you can save a screenshot of a part of the game as it currently appears in the game display.
zh_cn: 通过此函数，你可以保存游戏部分的截图，因为它目前出现在游戏显示中。

source: With this function you can save a screenshot of the game as it currently appears in the game window.
zh_cn: 通过此函数，你可以保存游戏的截图，因为它目前出现在游戏窗口。

source: With this function you can save out a GIF animation.
zh_cn: 通过此函数，您可以保存GIF动画。

source: With this function you can save part of the contents of a buffer to a file, ready to be read back into memory using the buffer_load() function (or any of the other functions for loading buffers).
zh_cn: 使用此函数，您可以将一个缓冲区的部分内容保存到一个文件中，以备使用buffer_load()函数(或任何其他用于加载缓冲区的函数)读回内存中。

source: With this function you can save part of the contents of a buffer to a file, ready to be read back into memory using the buffer_load() function.
zh_cn: 使用此函数，您可以将缓冲区的内容保存到一个文件中，以便使用buffer_load()函数将其读回内存中。

source: With this function you can save the contents of a buffer to a file, ready to be read back into memory using the buffer_load() function.
zh_cn: 使用此函数，您可以将缓冲区的内容保存到一个文件中，以便使用buffer_load()函数将其读回内存中。

source: With this function you can send a "raw" data packet through the network.
zh_cn: 通过此函数，你可以通过网络发送一个"原始"数据包。

source: With this function you can send a data "packet" through the network.
zh_cn: 通过此函数，你可以通过网络发送一个数据"包"。

source: With this function you can send a request to connect to a server.
zh_cn: 通过此函数，您可以发送连接到服务器的请求。

source: With this function you can send data over the network using UDP to a server.
zh_cn: 通过此函数，您可以通过网络使用UDP发送数据到服务器。

source: With this function you can set a circular region of a grid to a certain value.
zh_cn: 通过此函数，您可以将网格的圆形区域设置为某个值。

source: With this function you can set a global state for all shaders being used where, when enabled, the shader "steals" 2 bits from the input colour values.
zh_cn: 使用此函数，你可以为所有正在使用的着色器设置一个全局状态，当启用时，着色器从输入颜色值中"窃取(steals)"2位。

source: With this function you can set a hue, saturation and value range for all particles of the given type.
zh_cn: 通过此函数，您可以为给定类型的所有粒子设置色调、饱和度和值范围。

source: With this function you can set a shader constant to hold an array of values.
zh_cn: 使用此函数，你可以设置一个着色器常量来保存一个数组。

source: With this function you can set an attachment slot colour and alpha so all sprites attached to it will be drawn with these blend values.
zh_cn: 通过此函数，你可以设置附件槽的颜色和alpha值，这样所有附加到它的精灵都将用这些混合值绘制。

source: With this function you can set an attachment to a given slot, where you are required to give the names (as strings) of the slot and the attachment.
zh_cn: 通过此函数，您可以将附件设置到给定的插槽，您需要给出插槽和附件的名称(字符串形式)。

source: With this function you can set different network configurations.
zh_cn: 通过此函数，您可以设置不同的网络配置。

source: With this function you can set how many audio channels are available for playing audio in GameMaker.
zh_cn: 通过此函数，你可以在GameMaker中设置播放音频的音频通道数量。

source: With this function you can set some platform specific options for the buffer group being saved.
zh_cn: 通过此函数，您可以为所保存的缓冲组设置一些特定于平台的选项。

source: With this function you can set that seed to a known value and so "force" the outcome of all random events afterwards to be the same every time the program is run.
zh_cn: 使用此函数，你可以将种子设置为一个已知的值，这样就"强制"所有随机事件的结果在程序每次运行时都是相同的。

source: With this function you can set the X scale for the given sequence element.
zh_cn: 通过此函数，您可以为给定的序列元素设置X缩放。

source: With this function you can set the Y scale for the given sequence element.
zh_cn: 通过此函数，您可以为给定的序列元素设置Y缩放。

source: With this function you can set the absolute value for the global volume of all sounds and music for a specific listener.
zh_cn: 通过此函数，您可以为特定侦听器设置所有声音和音乐的全局音量绝对值。

source: With this function you can set the absolute value for the global volume of all sounds and music.
zh_cn: 通过此函数，您可以设置所有声音和音乐的全局音量的绝对值。

source: With this function you can set the angle of rotation for the given sequence element.
zh_cn: 通过此函数，您可以设置给定序列元素的旋转角度。

source: With this function you can set the base draw alpha for the game.
zh_cn: 通过此函数，您可以设置游戏的基本绘制alpha。

source: With this function you can set the base draw colour for the game.
zh_cn: 通过此函数，您可以设置游戏的基本抽奖颜色。

source: With this function you can set the base position for the particle system relative to the (0,0) position of the room, meaning that all further particle functions relating to this system will now be drawn relative to the new position.
zh_cn: 通过此函数，你可以设置粒子系统相对于房间的(0,0)位置的基本位置，这意味着所有与该系统相关的进一步粒子函数现在将相对于新位置绘制。

source: With this function you can set the cross origin type to use when loading images from a file.
zh_cn: 通过此函数，您可以设置从文件加载图像时使用的跨域类型类型。

source: With this function you can set the current maximum level of anisotropy when using the tf_anisotropic filter mode (see gpu_get_tex_mip_filter() for more information).
zh_cn: 使用此函数，您可以在使用tf_anisotropic filter模式时设置当前的最大各向异性级别(有关详细信息，请参见gpu_get_tex_mip_filter())。

source: With this function you can set the current mip filter mode to one of the three types supported.
zh_cn: 通过此函数，您可以将当前mip过滤器模式设置为支持的三种类型之一。

source: With this function you can set the currently set maximum mipmap level which is to be used, where a value of 0 is the highest resolution, 1 is to use the first mipmap, 2 is the second etc...
zh_cn: 通过此函数，您可以设置当前设置的要使用的最大mipmap级别，其中值0表示最高分辨率，1表示使用第一个mipmap，2表示第二个mipmap，依此类推...

source: With this function you can set the cursor for the game window to any one of the constants listed below (to find the current cursor being used you can use the function window_get_cursor() which will also return one of these constants):
zh_cn: 使用此函数，你可以将游戏窗口的光标设置为下面列出的任意一个常量(为了找到当前正在使用的光标，你可以使用函数window_get_cursor()，它也会返回这些常量之一):

source: With this function you can set the density of the particles in a physics simulation.
zh_cn: 通过此函数，您可以在物理模拟中设置粒子的密度。

source: With this function you can set the direction for the given sequence playhead.
zh_cn: 通过此函数，您可以为给定的序列播放头设置方向。

source: With this function you can set the draw depth for the particle system, much the same as you can set the render depth of different layers within the room, where a low draw depth means that it will appear on top of all things drawn with a higher depth, and a high draw depth placing it below everything with a lower draw depth.
zh_cn: 通过此函数，你可以为粒子系统设置绘制深度，就像你可以设置房间内不同图层的渲染深度一样，较低的绘制深度意味着它将出现在所有具有较高深度的绘制对象的上方，而较高的绘制深度则意味着它将出现在具有较低深度的绘制对象的下方。

source: With this function you can set the drawing target to the given shader and all further drawing will be done using that.
zh_cn: 通过此函数，你可以将绘制目标设置为给定的着色器，所有后续的绘制都将使用该着色器完成。

source: With this function you can set the fall-off distance for an emitter.
zh_cn: 通过此函数，您可以设置发射器的衰减距离。

source: With this function you can set the game window to a specific position within the display (on macOS, Linux(Ubuntu) and Windows) or within the browser (HTML5).
zh_cn: 通过此函数，您可以将游戏窗口设置到显示器(在macOS、Linux(Ubuntu)和Windows上)或浏览器(HTML5)中的特定位置。

source: With this function you can set the game window to be full screen (true) or not (false).
zh_cn: 通过此函数，你可以将游戏窗口设置为全屏(true)或非全屏(false)。

source: With this function you can set the given particle type to be a random blend of two colours.
zh_cn: 通过此函数，您可以将给定的粒子类型设置为两种颜色的随机混合。

source: With this function you can set the gravity scale factor for particles in the physics simulation.
zh_cn: 通过此函数，您可以在物理模拟中设置粒子的重力缩放倍数。

source: With this function you can set the instance to a position anywhere in the room, but aligned to an "invisible" grid.
zh_cn: 通过此函数，您可以将实例设置到房间中的任何位置，但要与"不可见"的网格对齐。

source: With this function you can set the linear damping of particles in the simulation.
zh_cn: 通过此函数，您可以在模拟中设置粒子的线性阻尼。
